package com.example.islamiapp.Home

object Constants {

    val SURA_NAME_LIST: List<String> = listOf("الفاتحه","البقرة","آل عمران",
        "النساء","المائدة","الأنعام","الأعراف","الأنفال","التوبة","يونس",
        "هود"
        ,"يوسف","الرعد","إبراهيم","الحجر","النحل","الإسراء","الكهف",
        "مريم","طه","الأنبياء","الحج","المؤمنون"
        ,"النّور","الفرقان","الشعراء","النّمل","القصص","العنكبوت",
        "الرّوم","لقمان","السجدة","الأحزاب","سبأ"
        ,"فاطر","يس","الصافات","ص","الزمر","غافر","فصّلت","الشورى",
        "الزخرف","الدّخان","الجاثية","الأحقاف"
        ,"محمد","الفتح","الحجرات","ق","الذاريات","الطور","النجم",
        "القمر","الرحمن","الواقعة","الحديد","المجادلة"
        ,"الحشر","الممتحنة","الصف","الجمعة","المنافقون","التغابن",
        "الطلاق","التحريم","الملك","القلم","الحاقة","المعارج"
        ,"نوح","الجن","المزّمّل","المدّثر","القيامة","الإنسان","المرسلات",
        "النبأ","النازعات","عبس","التكوير","الإنفطار"
        ,"المطفّفين","الإنشقاق","البروج","الطارق","الأعلى","الغاشية",
        "الفجر","البلد","الشمس","الليل","الضحى","الشرح"
        ,"التين","العلق","القدر","البينة","الزلزلة","العاديات",
        "القارعة","التكاثر","العصر",
        "الهمزة","الفيل","قريش","الماعون","الكوثر","الكافرون",
        "النصر","المسد","الإخلاص","الفلق","الناس")


    val Hadeeth_Name_List: List<String> = listOf(
            "الحديث الأول", "الحديث الثاني", "الحديث الثالث","الحديث الرابع", "الحديث الخامس", "الحديث السادس",
            "الحديث السابع", "الحديث الثامن", "الحديث التاسع", "الحديث العاشر", "الحديث الحادي عشر",
            "الحديث الثاني عشر","الحديث الثالث عشر", "الحديث الرابع عشر", "الحديث الخامس عشر",
        "الحديث السادس عشر", "الحديث السابع عشر", "الحديث الثامن عشر", "الحديث التاسع عشر", "الحديث العشرون",
        "الحديث الحادي والعشرون",
        "الحديث الثاني والعشرون",
        "الحديث الثالث والعشرون",
        "الحديث الرابع والعشرون",
        "الحديث الخامس والعشرون",
        "الحديث السادس والعشرون",
        "الحديث السابع والعشرون",
        "الحديث الثامن والعشرون",
        "الحديث التاسع والعشرون",
        "الحديث الثلاثون",
        "الحديث الحادي والثلاثون",
        "الحديث الثاني والثلاثون",
        "الحديث الثالث والثلاثون",
        "الحديث الرابع والثلاثون",
        "الحديث الخامس والثلاثون",
        "الحديث السادس والثلاثون",
        "الحديث السابع والثلاثون",
        "الحديث الثامن والثلاثون",
        "الحديث التاسع والثلاثون",
        "الحديث الأربعون",
        "الحديث الحادي والأربعون",
        "الحديث الثاني والأربعون",
        "الحديث الثالث والأربعون",
        "الحديث الرابع والأربعون",
        "الحديث الخامس والأربعون",
        "الحديث السادس والأربعون",
        "الحديث السابع والأربعون",
        "الحديث الثامن والأربعون",
        "الحديث التاسع والأربعون",
        "الحديث الخمسون"



    )

    val HEADER_NAME= "header"
    val CONTENT_NAME= "content"
}